Cypherock/x1_wallet_hal_stm32/libusb/libusb.c
/* This file is the part of the Lightweight USB device Stack for STM32 microcontrollers
 *
 * Copyright ©2016 Dmitry Filimonchuk <dmitrystu[at]gmail[dot]com>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *   http://www.apache.org/licenses/LICENSE-2.0
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "stm32.h"
#include "usb.h"
#include "usb_cdc.h"
#include "usb_hid.h"
#include "hid_usage_desktop.h"
#include "hid_usage_button.h"
#include "sdk_config.h"
#include "libusb.h"

static uint8_t data[1000] = {0}, data_len=0;
// #define ENABLE_HID_COMBO

#define CDC_EP0_SIZE    0x08
#define CDC_RXD_EP      0x01
#define WEBUSB_RXD_EP   0x03
#define CDC_TXD_EP      0x81
#define WEBUSB_TXD_EP   0x83
#define CDC_DATA_SZ     0x40
#define CDC_NTF_EP      0x82
#define CDC_NTF_SZ      0x08
#define HID_RIN_EP      0x83
#define HID_RIN_SZ      0x10

#define WEBUSB_REQUEST_GET_ALLOWED_ORIGINS  0x01
#define WEBUSB_REQUEST_GET_URL              0x02

#define LU_RX_PKT_BUF_COUNT     3
#define LU_TX_PKT_BUF_COUNT     3

// Bootloader takes upto 128 byte payloads while application takes about 88 bytes long payload
#define BYTE_STUFFED_DATA_SIZE                 128

#define LU_RX_BUF_SIZE          (BYTE_STUFFED_DATA_SIZE * LU_RX_PKT_BUF_COUNT)
#define LU_TX_BUF_SIZE          (BYTE_STUFFED_DATA_SIZE * LU_TX_PKT_BUF_COUNT)

//#define SIGNAL_MODEM
#define CDC_USE_IRQ

#if defined(SIGNAL_MODEM)
#define CDC_PROTOCOL USB_CDC_PROTO_V25TER
#else
#define CDC_PROTOCOL USB_PROTO_NONE
#endif

libusb_parser_fptr_t parseFun;

/* Declaration of the report descriptor */
struct cdc_config {
    struct usb_config_descriptor        config;
    // struct usb_iad_descriptor           comm_iad;
    // struct usb_interface_descriptor     comm;
    // struct usb_cdc_header_desc          cdc_hdr;
    // struct usb_cdc_call_mgmt_desc       cdc_mgmt;
    // struct usb_cdc_acm_desc             cdc_acm;
    // struct usb_cdc_union_desc           cdc_union;
    // struct usb_endpoint_descriptor      comm_ep;
    struct usb_interface_descriptor     data;
    struct usb_hid_descriptor           hid_desc;
    struct usb_endpoint_descriptor      data_eprx;
    struct usb_endpoint_descriptor      data_eptx;
    struct usb_interface_descriptor     webdata;
    // struct usb_hid_descriptor           hid_desc;
    struct usb_endpoint_descriptor      webdata_eprx;
    struct usb_endpoint_descriptor      webdata_eptx;
#ifdef ENABLE_HID_COMBO
    struct usb_interface_descriptor     hid;
    struct usb_hid_descriptor           hid_desc;
    struct usb_endpoint_descriptor      hid_ep;
#endif //ENABLE_HID_COMBO
} __attribute__((packed));

/* Device descriptor */
static const struct usb_device_descriptor device_desc = {
    .bLength            = sizeof(struct usb_device_descriptor),
    .bDescriptorType    = USB_DTYPE_DEVICE,
    .bcdUSB             = VERSION_BCD(2,0,1),
    .bDeviceClass       = USB_CLASS_IAD,
    .bDeviceSubClass    = USB_SUBCLASS_IAD,
    .bDeviceProtocol    = USB_PROTO_IAD,
    .bMaxPacketSize0    = CDC_EP0_SIZE,
    .idVendor           = BSP_USB_VID,
    .idProduct          = BSP_USB_PID,
    .bcdDevice          = VERSION_BCD(2,0,0),
    .iManufacturer      = 1,
    .iProduct           = 2,
    .iSerialNumber      = INTSERIALNO_DESCRIPTOR,
    .bNumConfigurations = 1,
};

/* HID mouse report desscriptor. 2 axis 5 buttons */
static const uint8_t hid_report_desc[] = {
  0x06, 0xa0, 0xff, 0x09, 0x01, 0xa1, 0x01, 0x09,
  0x03, 0x15, 0x00, 0x26, 0xff, 0x00, 0x75, 0x08,
  0x95, 0x40, 0x81, 0x08, 0x09, 0x04, 0x15, 0x00,
  0x26, 0xff, 0x00, 0x75, 0x08, 0x95, 0x40, 0x91,
  0x08, 0xc0
};

/* Device configuration descriptor */
static const struct cdc_config config_desc = {
    .config = {
        .bLength                = sizeof(struct usb_config_descriptor),
        .bDescriptorType        = USB_DTYPE_CONFIGURATION,
        .wTotalLength           = sizeof(struct cdc_config),
        .bNumInterfaces         = 2,
        .bConfigurationValue    = 1,
        .iConfiguration         = NO_DESCRIPTOR,
        .bmAttributes           = USB_CFG_ATTR_RESERVED | USB_CFG_ATTR_SELFPOWERED,
        .bMaxPower              = USB_CFG_POWER_MA(200),
    },
    // .comm_iad = {
    //     .bLength = sizeof(struct usb_iad_descriptor),
    //     .bDescriptorType        = USB_DTYPE_INTERFASEASSOC,
    //     .bFirstInterface        = 0,
    //     .bInterfaceCount        = 2,
    //     .bFunctionClass         = USB_CLASS_CDC,
    //     .bFunctionSubClass      = USB_CDC_SUBCLASS_ACM,
    //     .bFunctionProtocol      = CDC_PROTOCOL,
    //     .iFunction              = NO_DESCRIPTOR,
    // },
    // .comm = {
    //     .bLength                = sizeof(struct usb_interface_descriptor),
    //     .bDescriptorType        = USB_DTYPE_INTERFACE,
    //     .bInterfaceNumber       = 0,
    //     .bAlternateSetting      = 0,
    //     .bNumEndpoints          = 1,
    //     .bInterfaceClass        = USB_CLASS_CDC,
    //     .bInterfaceSubClass     = USB_CDC_SUBCLASS_ACM,
    //     .bInterfaceProtocol     = CDC_PROTOCOL,
    //     .iInterface             = NO_DESCRIPTOR,
    // },
    // .cdc_hdr = {
    //     .bFunctionLength        = sizeof(struct usb_cdc_header_desc),
    //     .bDescriptorType        = USB_DTYPE_CS_INTERFACE,
    //     .bDescriptorSubType     = USB_DTYPE_CDC_HEADER,
    //     .bcdCDC                 = VERSION_BCD(1,1,0),
    // },
    // .cdc_mgmt = {
    //     .bFunctionLength        = sizeof(struct usb_cdc_call_mgmt_desc),
    //     .bDescriptorType        = USB_DTYPE_CS_INTERFACE,
    //     .bDescriptorSubType     = USB_DTYPE_CDC_CALL_MANAGEMENT,
    //     .bmCapabilities         = 0,
    //     .bDataInterface         = 1,

