Cypherock/x1_wallet_hal_stm32/libusb/libusb.c
    // },
    // .cdc_acm = {
    //     .bFunctionLength        = sizeof(struct usb_cdc_acm_desc),
    //     .bDescriptorType        = USB_DTYPE_CS_INTERFACE,
    //     .bDescriptorSubType     = USB_DTYPE_CDC_ACM,
    //     .bmCapabilities         = 0,
    // },
    // .cdc_union = {
    //     .bFunctionLength        = sizeof(struct usb_cdc_union_desc),
    //     .bDescriptorType        = USB_DTYPE_CS_INTERFACE,
    //     .bDescriptorSubType     = USB_DTYPE_CDC_UNION,
    //     .bMasterInterface0      = 0,
    //     .bSlaveInterface0       = 1,
    // },
    // .comm_ep = {
    //     .bLength                = sizeof(struct usb_endpoint_descriptor),
    //     .bDescriptorType        = USB_DTYPE_ENDPOINT,
    //     .bEndpointAddress       = CDC_NTF_EP,
    //     .bmAttributes           = USB_EPTYPE_INTERRUPT,
    //     .wMaxPacketSize         = CDC_NTF_SZ,
    //     .bInterval              = 0xFF,
    // },
    .data = {
        .bLength                = sizeof(struct usb_interface_descriptor),
        .bDescriptorType        = USB_DTYPE_INTERFACE,
        .bInterfaceNumber       = 0,
        .bAlternateSetting      = 0,
        .bNumEndpoints          = 2,
        .bInterfaceClass        = USB_CLASS_HID,
        .bInterfaceSubClass     = USB_SUBCLASS_NONE,
        .bInterfaceProtocol     = USB_PROTO_NONE,
        .iInterface             = 2,
    },
    .hid_desc = {
        .bLength                = sizeof(struct usb_hid_descriptor),
        .bDescriptorType        = USB_DTYPE_HID,
        .bcdHID                 = VERSION_BCD(1,1,1),
        .bCountryCode           = USB_HID_COUNTRY_NONE,
        .bNumDescriptors        = 1,
        .bDescriptorType0       = USB_DTYPE_HID_REPORT,
        .wDescriptorLength0     = sizeof(hid_report_desc),
    },
    .data_eprx = {
        .bLength                = sizeof(struct usb_endpoint_descriptor),
        .bDescriptorType        = USB_DTYPE_ENDPOINT,
        .bEndpointAddress       = CDC_RXD_EP,
        .bmAttributes           = USB_EPTYPE_INTERRUPT,
        .wMaxPacketSize         = CDC_DATA_SZ,
        .bInterval              = 0x01,
    },
    .data_eptx = {
        .bLength                = sizeof(struct usb_endpoint_descriptor),
        .bDescriptorType        = USB_DTYPE_ENDPOINT,
        .bEndpointAddress       = CDC_TXD_EP,
        .bmAttributes           = USB_EPTYPE_INTERRUPT,
        .wMaxPacketSize         = CDC_DATA_SZ,
        .bInterval              = 0x01,
    },
    .webdata = {
        .bLength                = sizeof(struct usb_interface_descriptor),
        .bDescriptorType        = USB_DTYPE_INTERFACE,
        .bInterfaceNumber       = 1,
        .bAlternateSetting      = 0,
        .bNumEndpoints          = 2,
        .bInterfaceClass        = 0xff,
        .bInterfaceSubClass     = 0x00,
        .bInterfaceProtocol     = 0x00,
        .iInterface             = NO_DESCRIPTOR,
    },
    .webdata_eprx = {
        .bLength                = sizeof(struct usb_endpoint_descriptor),
        .bDescriptorType        = USB_DTYPE_ENDPOINT,
        .bEndpointAddress       = WEBUSB_RXD_EP,
        .bmAttributes           = USB_EPTYPE_INTERRUPT,
        .wMaxPacketSize         = CDC_DATA_SZ,
        .bInterval              = 0x01,
    },
    .webdata_eptx = {
        .bLength                = sizeof(struct usb_endpoint_descriptor),
        .bDescriptorType        = USB_DTYPE_ENDPOINT,
        .bEndpointAddress       = WEBUSB_TXD_EP,
        .bmAttributes           = USB_EPTYPE_INTERRUPT,
        .wMaxPacketSize         = CDC_DATA_SZ,
        .bInterval              = 0x01,
    },
#ifdef ENABLE_HID_COMBO
    .hid = {
        .bLength                = sizeof(struct usb_interface_descriptor),
        .bDescriptorType        = USB_DTYPE_INTERFACE,
        .bInterfaceNumber       = 2,
        .bAlternateSetting      = 0,
        .bNumEndpoints          = 1,
        .bInterfaceClass        = USB_CLASS_HID,
        .bInterfaceSubClass     = USB_HID_SUBCLASS_BOOT,
        .bInterfaceProtocol     = USB_HID_PROTO_KEYBOARD,
        .iInterface             = NO_DESCRIPTOR,
    },
    .hid_desc = {
        .bLength                = sizeof(struct usb_hid_descriptor),
        .bDescriptorType        = USB_DTYPE_HID,
        .bcdHID                 = VERSION_BCD(1,0,1),
        .bCountryCode           = USB_HID_COUNTRY_NONE,
        .bNumDescriptors        = 1,
        .bDescriptorType0       = USB_DTYPE_HID_REPORT,
        .wDescriptorLength0     = sizeof(hid_report_desc),
    },
    .hid_ep = {
        .bLength                = sizeof(struct usb_endpoint_descriptor),
        .bDescriptorType        = USB_DTYPE_ENDPOINT,
        .bEndpointAddress       = HID_RIN_EP,
        .bmAttributes           = USB_EPTYPE_INTERRUPT,
        .wMaxPacketSize         = HID_RIN_SZ,
        .bInterval              = 10,
    },
    // .webdata = {
    //     .bLength                = sizeof(struct usb_interface_descriptor),
    //     .bDescriptorType        = USB_DTYPE_INTERFACE,
    //     .bInterfaceNumber       = 3,
    //     .bAlternateSetting      = 0,
    //     .bNumEndpoints          = 2,
    //     .bInterfaceClass        = USB_CLASS_VENDOR,
    //     .bInterfaceSubClass     = USB_SUBCLASS_NONE,
    //     .bInterfaceProtocol     = USB_PROTO_NONE,
    //     .iInterface             = NO_DESCRIPTOR,
    // },
    // .webdata_eprx = {
    //     .bLength                = sizeof(struct usb_endpoint_descriptor),
    //     .bDescriptorType        = USB_DTYPE_ENDPOINT,
    //     .bEndpointAddress       = CDC_RXD_EP,
    //     .bmAttributes           = USB_EPTYPE_BULK,
    //     .wMaxPacketSize         = CDC_DATA_SZ,
    //     .bInterval              = 0x00,
    // },
    // .webdata_eptx = {
    //     .bLength                = sizeof(struct usb_endpoint_descriptor),
    //     .bDescriptorType        = USB_DTYPE_ENDPOINT,
    //     .bEndpointAddress       = CDC_TXD_EP,
    //     .bmAttributes           = USB_EPTYPE_BULK,
    //     .wMaxPacketSize         = CDC_DATA_SZ,
    //     .bInterval              = 0x00,
    // },
#endif // ENABLE_HID_COMBO
};

static const struct usb_string_descriptor lang_desc     = USB_ARRAY_DESC(USB_LANGID_ENG_US);
static const struct usb_string_descriptor manuf_desc_en = USB_STRING_DESC("HODL TECH PTE LTD");
static const struct usb_string_descriptor prod_desc_en  = USB_STRING_DESC("CYPHEROCK X1 WALLET");
static const struct usb_string_descriptor *const dtable[] = {
    &lang_desc,
    &manuf_desc_en,
    &prod_desc_en,
};

usbd_device libusb_udev;
uint32_t	ubuf[0x20];
uint8_t     fifo[LU_TX_BUF_SIZE];
uint8_t     rx_buffer[LU_RX_BUF_SIZE];
uint32_t    fpos = 0;

