Cypherock/x1_wallet_hal_stm32/libusb/libusb.c
static struct usb_cdc_line_coding cdc_line = {
    .dwDTERate          = 38400,
    .bCharFormat        = USB_CDC_1_STOP_BITS,
    .bParityType        = USB_CDC_NO_PARITY,
    .bDataBits          = 8,
    .blineState         = 0
};

struct usb_bos_cap_descriptor{
    struct usb_bos_descriptor           bos;
    struct usb_webusb_cap_descriptor    webusb_cap;
    struct usb_MSOS2_cap_descriptor     msos2_cap;
} __attribute__((packed));

const struct usb_bos_cap_descriptor bos_desc = {
    .bos = {
        .bLength                = sizeof(struct usb_bos_descriptor),
        .bDescriptorType        = USB_DTYPE_BOS,
        .wTotalLenght           = sizeof(struct usb_bos_cap_descriptor),
        .bNumDeviceCaps         = 2,
    },
    .webusb_cap = {
        .bLength                = sizeof(struct usb_webusb_cap_descriptor),
        .bDescriptorType        = USB_DTYPE_CAPABILITY,
        .bDevCapabilityType     = 0x05,
        .bReserved              = 0x00,
        .PlatformCapabilityUUID = {0x38, 0xB6, 0x08, 0x34, 0xA9, 0x09, 0xA0, 0x47, 0x8B, 0xFD, 0xA0, 0x76, 0x88, 0x15, 0xB6, 0x65},
        .bcdVersion             = VERSION_BCD(1,0,0),
        .bVendorCode            = USB_VENDOR_WEBUSB_REQUEST,
        .iLandingPage           = 0x01,
    },
    .msos2_cap = {
        .bLength                = sizeof(struct usb_MSOS2_cap_descriptor),
        .bDescriptorType        = USB_DTYPE_CAPABILITY,
        .bDevCapabilityType     = 0x05,
        .bReserved              = 0x00,
        .PlatformCapabilityUUID = {0xDF, 0x60, 0xDD, 0xD8, 0x89, 0x45, 0xC7, 0x4C, 0x9C, 0xD2, 0x65, 0x9D, 0x9E, 0x64, 0x8A, 0x9F},
        .dwWindowsVersion       = 0x06030000,
        .wMSOSDescriptorSetTotalLength = 0x00B2,
        .bMS_VendorCode         = 0x02,
        .bAltEnumCode           = 0x00,
    }
};

struct usb_MSOS2_set_descriptors {
    struct usb_MSOS2_desc_set_header_descriptor     desc_set_header;
    struct usb_MSOS2_conf_subset_header_descriptor  conf_subset_header;
    struct usb_MSOS2_func_subset_header_descriptor  func_subset_header;
    struct usb_MSOS2_comp_id_descriptor             comp_id;
    struct usb_MSOS2_reg_prop_descriptor            reg_prop;
};

const struct usb_MSOS2_set_descriptors msos2_desc_set = {
    .desc_set_header = {
        .wLength                    = sizeof(struct usb_MSOS2_desc_set_header_descriptor),
        .wDescriptorType            = 0x0000,
        .dwWindowsVersion           = 0x06030000,
        .wTotalLenght               = 0x00B2,
    },
    .conf_subset_header = {
        .wLength                    = sizeof(struct usb_MSOS2_conf_subset_header_descriptor),
        .wDescriptorType            = 0x0001,
        .bConfigurationValue        = 0x00,
        .bReserved                  = 0x00,
        .wTotalLenght               = 0x00A8,
    },
    .func_subset_header = {
        .wLength                    = sizeof(struct usb_MSOS2_func_subset_header_descriptor),
        .wDescriptorType            = 0x0002,
        .bFirstInterface            = 0x01,
        .bReserved                  = 0x00,
        .wSubsetLenght              = 0x00A0,
    },
    .comp_id = {
        .wLength                    = sizeof(struct usb_MSOS2_comp_id_descriptor),
        .wDescriptorType            = 0x0003,
        .CompatibleID               = {'W', 'I', 'N', 'U', 'S', 'B', '\0', '\0'},
        .SubCompatibleID            = {'\0', '\0', '\0', '\0', '\0', '\0', '\0', '\0'},
    },
    .reg_prop = {
        .wLength                    = sizeof(struct usb_MSOS2_reg_prop_descriptor),
        .wDescriptorType            = 0x0004,
        .wPropertyDataType          = 0x0007,
        .wPropertyNameLength        = 0x002A,
        .PropertyName               = {'D', 0x00, 'e', 0x00, 'v', 0x00, 'i', 0x00, 'c', 0x00, 'e', 0x00, 'I', 0x00, 'n', 0x00, 't', 0x00, 'e', 0x00, 
                                        'r', 0x00, 'f', 0x00, 'a', 0x00, 'c', 0x00, 'e', 0x00, 'G', 0x00, 'U', 0x00, 'I', 0x00, 'D', 0x00, 's', 0x00, 0x00, 0x00}, 
        .wPropertyDataLength        = 0x0050,
        .PropertyData               = {'{', 0x00, '9', 0x00, '7', 0x00, '5', 0x00, 'F', 0x00, '4', 0x00, '4', 0x00, 'D', 0x00, '9', 0x00, '-', 0x00, 
                                        '0', 0x00, 'D', 0x00, '0', 0x00, '8', 0x00, '-', 0x00, '4', 0x00, '3', 0x00, 'F', 0x00, 'D', 0x00, '-', 0x00, 
                                        '8', 0x00, 'B', 0x00, '3', 0x00, 'E', 0x00, '-', 0x00, '1', 0x00, '2', 0x00, '7', 0x00, 'C', 0x00, 'A', 0x00, 
                                        '8', 0x00, 'A', 0x00, 'F', 0x00, 'F', 0x00, 'F', 0x00, '9', 0x00, 'D', 0x00, '}', 0x00, 0x00, 0x00, 0x00, 0x00}
    },
};

const struct usb_url_descriptor url_desc = {
    .bLength            = sizeof(struct usb_url_descriptor),
    .bDescriptorType    = 0x03,
    .bScheme            = 0x01,
    .URL                = {0x77, 0x65, 0x62, 0x75, 0x73, 0x62, 0x2E, 0x67, 0x69, 0x74, 0x68, 0x75, 0x62, 0x2E, 0x69, 0x6F, 0x2F, 0x61, 0x72, 0x64, 0x75, 0x69, 0x6E, 0x6F, 0x2F, 0x64, 0x65, 0x6D, 0x6F, 0x73, 0x2F, 0x72, 0x67, 0x62},
};

static usbd_respond cdc_getdesc (usbd_ctlreq *req, void **address, uint16_t *length) {
    const uint8_t dtype = req->wValue >> 8;
    const uint8_t dnumber = req->wValue & 0xFF;
    const void* desc;
    uint16_t len = 0;
    switch (dtype) {
    case USB_DTYPE_DEVICE:
        desc = &device_desc;
        break;
    case USB_DTYPE_CONFIGURATION:
        desc = &config_desc;
        len = sizeof(config_desc);
        break;
    case USB_DTYPE_STRING:
        if (dnumber < 3) {
            desc = dtable[dnumber];
        } else {
            return usbd_fail;
        }
        break;
    default:
        return usbd_fail;
    }
    if (len == 0) {
        len = ((struct usb_header_descriptor*)desc)->bLength;
    }
    *address = (void*)desc;
    *length = len;
    return usbd_ack;
}

static usbd_respond cdc_control(usbd_device *dev, usbd_ctlreq *req, usbd_rqc_callback *callback) {
    // if (((USB_REQ_RECIPIENT | USB_REQ_TYPE) & req->bmRequestType) == (USB_REQ_INTERFACE | USB_REQ_CLASS)
    //     && req->wIndex == 0 ) {
    //     switch (req->bRequest) {
    //     case USB_CDC_SET_CONTROL_LINE_STATE:
    //         return usbd_ack;
    //     case USB_CDC_SET_LINE_CODING:
    //         memcpy(&cdc_line, req->data, sizeof(cdc_line));
    //         return usbd_ack;
    //     case USB_CDC_GET_LINE_CODING:
    //         dev->status.data_ptr = &cdc_line;
    //         dev->status.data_count = sizeof(cdc_line);
    //         return usbd_ack;
    //     default:
    //         return usbd_fail;
    //     }
    // }

    if (((USB_REQ_RECIPIENT | USB_REQ_TYPE) & req->bmRequestType) == (USB_REQ_INTERFACE | USB_REQ_CLASS)
        && req->wIndex == 1 ) {
        switch (req->bRequest) {
        case USB_CDC_SET_CONTROL_LINE_STATE:
            cdc_line.blineState = (uint8_t)(req->wValue);
            return usbd_ack;
        case USB_CDC_SET_LINE_CODING:
            memcpy(&cdc_line, req->data, sizeof(cdc_line));
            return usbd_ack;
        case USB_CDC_GET_LINE_CODING:
            dev->status.data_ptr = &cdc_line;
            dev->status.data_count = sizeof(cdc_line);
            return usbd_ack;
        default:
            return usbd_fail;
        }
    }

    if (((USB_REQ_RECIPIENT | USB_REQ_TYPE) & req->bmRequestType) == (USB_REQ_INTERFACE | USB_REQ_CLASS)
        && req->wIndex == 0 ) {
        switch (req->bRequest) {
        case USB_HID_SETIDLE:
            return usbd_ack;
        case USB_HID_GETREPORT:
            dev->status.data_ptr = &hid_report_desc;
            dev->status.data_count = sizeof(hid_report_desc);
            return usbd_ack;
        default:
            return usbd_fail;
        }
    }
    if (((USB_REQ_RECIPIENT | USB_REQ_TYPE) & req->bmRequestType) == (USB_REQ_INTERFACE | USB_REQ_STANDARD)
        && req->wIndex == 0
        && req->bRequest == USB_STD_GET_DESCRIPTOR) {
        switch (req->wValue >> 8) {
        case USB_DTYPE_HID:
            dev->status.data_ptr = (uint8_t*)&(config_desc.hid_desc);
            dev->status.data_count = sizeof(config_desc.hid_desc);
            return usbd_ack;
        case USB_DTYPE_HID_REPORT:
            dev->status.data_ptr = (uint8_t*)hid_report_desc;
            dev->status.data_count = sizeof(hid_report_desc);
            return usbd_ack;
        default:
            return usbd_fail;
        }
    }
    if (((USB_REQ_RECIPIENT | USB_REQ_TYPE) & req->bmRequestType) == (USB_REQ_STANDARD | USB_REQ_DEVICE)
        && req->wIndex == 0
        && req->bRequest == USB_STD_GET_DESCRIPTOR) {
        switch (req->wValue >> 8) {
        case 0x0F:
            dev->status.data_ptr = (uint8_t*)&bos_desc;
            dev->status.data_count = sizeof(bos_desc);
            return usbd_ack;
        default:
            return usbd_fail;
        }
    }
    if (((USB_REQ_RECIPIENT | USB_REQ_TYPE) & req->bmRequestType) == (USB_REQ_STANDARD | USB_REQ_VENDOR)
        && req->wIndex == 7
        && req->bRequest == 0x02) {
        switch (req->wValue >> 8) {
        case 0x00:
            dev->status.data_ptr = (uint8_t*)&msos2_desc_set;
            dev->status.data_count = sizeof(msos2_desc_set);
            return usbd_ack;
        default:
            return usbd_fail;
        }
    }
    if (((USB_REQ_RECIPIENT | USB_REQ_TYPE) & req->bmRequestType) == (USB_REQ_STANDARD | USB_REQ_VENDOR)
        && req->wIndex == 1
        && req->bRequest == 0x01) {
        switch (req->wValue) {
        case 0x0001:
            dev->status.data_ptr = (uint8_t*)&url_desc;
            dev->status.data_count = sizeof(url_desc);
            return usbd_ack;
        default:
            return usbd_fail;
        }
    }

